Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: • apply knowledge about the Norwegian health services to gain access to
nn: • bruke kunnskap om det norske helsevesenet til å få tilgang til ulike

source: • Female genital mutilation is a traditional practice linked to local
nn: • Kjønnslemlesting er ein tradisjonell praksis som er knytt til lokale

source: • An intimate partner rape is rape where
nn: • Ei «relasjonsvaldtekt» er ei valdtekt der

source: Goal management, reflection on and assessment of own learning are good tools for defining expectations and learning outcomes.
nn: Målstyring, refleksjon over og vurdering av eiga læring er gode verktøy for å konkretisera forventningar og læringsresultat.

source: • Girl are especially exposed to social control.
nn: • Jenter er særleg utsette for sosial kontroll.

source: HIV is a virus that can develop into the infection known as AIDS.
nn: Hiv er eit virus som kan utvikle seg til sjukdommen aids.

source: • express and explain in brief terms opinions on simple coherent texts;
nn: • uttrykke og kort grunngi meiningar i enkle samanhengande tekstar

source: Participants must develop the reading and listening strategies they need to understand spoken and written Norwegian in different situations, including strategies for handling dialects and the forms of Norwegian they encounter in everyday life.
nn: Deltakarane skal utvikle lese- og lyttestrategiane dei treng for å forstå munnleg og skriftleg norsk i ulike samanhengar, mellom anna strategiar for å handtere dialektar og målformer dei møter i dagleglivet.

source: • A marriage entered into outside Norway where one or both of the
nn: • Eit ekteskap som er inngått i utlandet der éin eller begge partar ikkje

source: In such cases, it will be useful and motivating to organise the training around these activities and participants’ goals regarding further qualifications and work.
nn: Da vil det vere nyttig og motiverande å organisere opplæringa rundt desse aktivitetane og dei måla deltakarane har for vidare kvalifisering og arbeid.

source: • write clear and detailed explanatory texts;
nn: • skrive klare og detaljerte utgreiande tekstar

source: The curricula for Norwegian language training and social studies for adult immigrants, and for primary and secondary education, have the same interdisciplinary topics.
nn: Dei tverrfaglege temaa er felles for læreplanane i norsk og samfunnskunnskap for vaksne innvandrarar og læreplanane i grunnopplæringa.

source: When the teaching is organised so that the communication is authentic, and participants use their own skills, this generates interest and meaningful learning, as well as active learners who participate in their own learning process.
nn: Når ein legg til rette undervisninga slik at kommunikasjonen blir autentisk og deltakarane får brukt seg sjølve, skapar det engasjement og meiningsfull læring og aktive innlærarar som tek del i sin eigen læringsprosess.

source: A multi-modal writing and communication culture The reception and production modes of communication are divided into oral reception and production (listen and speak) and written reception and production (read and write).
nn: Ein multimodal skrift- og kommunikasjonskultur Kommunikasjonskategoriane resepsjon og produksjon er delte inn i munnleg resepsjon og produksjon (lytte og snakke) og skriftleg resepsjon og produksjon (lese og skrive).

source: Participants may need contextual support.
nn: Deltakaren kan ha behov for kontekstuell støtte.

source: • give examples of the rights, duties and opportunities of children, adolescents
nn: • gi eksempel på barn, unge og vaksnes rettar, plikter og moglegheiter i det

source: • read and understand the main points in simple news articles and relatively
nn: • lese og forstå hovudpoeng i enkle nyheitsartiklar og relativt enkle tekstar

source: • participate in simple conversations about events, experiences and practical
nn: • delta i enkle samtalar om hendingar, opplevingar og praktiske gjeremål i

source: Smoking indoors is against the law, except in private homes.
nn: Det er forbode å røyke innandørs, med unntak av i private heimar.

source: • discuss family planning, contraception and abortion, understanding and
nn: • samtale om familieplanlegging, prevensjonsmiddel og abort, forståing og

source: • In Oslo, there is dedicated resource centre
nn: • I Oslo finst det også eit eige ressurssenter

source: • employ simple listening strategies, such as deriving the meaning of specific,
nn: • bruke nokre enkle lyttestrategiar, som å utleie betydninga av konkrete,

source: • write simple formal emails and letters, for example in connection with a job
nn: • skrive enkle, formelle e-postar og brev, for eksempel i samband med ein

source: At level B2, participants can understand complex language and can express themselves objectively, clearly and in a nuanced way on a wide range of general topics and topics within their occupation and areas of interest.
nn: På nivå B2 kan deltakaren forstå komplekst språk og uttrykke seg sakleg, klart og nyansert om eit vidt spekter av allmenne emne og emne innanfor eige fagfelt og eigne interesseområde.

source: • recognise icons and make relevant choices in apps and vending machines
nn: • kjenne att ikon og gjere relevante val i appar, på automatar og på enkle

source: • Rape does not necessarily involve intercourse.
nn: • Valdtekt treng ikkje å involvere samleie.

source: • read and understand familiar words and phrases in short and very simple
nn: • lese og forstå kjende ord og frasar i korte og svært enkle rutinemessige

source: • initiate, maintain and conclude a conversation in an appropriate way, with
nn: • innleie, oppretthalde og avslutte ein samtale på ein passande måte, med

source: These are often participants who have little experience with writing or who have not learned to read and write in any language.
nn: Dette er ofte deltakarar som har lite erfaring med skrift eller ikkje har lært å lese og skrive på noko språk.

source: and politics and its significance for the development of society;
nn: politikk, og kva betydning det har for utviklinga av samfunnet

source: Yes, this is my girlfriend, Anna.
nn: Ja, det er kjærasten min, Anna.

source: Section 28 of the Integration Regulations stipulates minimum levels of Norwegian for different participants.
nn: I forskrift til integreringsloven § 28 (integreringsforskrifta) er det fastsett rettleiande minimumsnivå i norsk for ulike deltakarar.

source: More people dare to ask questions and try out their knowledge.
nn: Fleire tør å spørja og å prøva ut den kunnskapen dei har.

source: The objective of the training is for participants to be able to read and understand words, sentences and short, very simple texts on familiar everyday topics.
nn: Mål for opplæringa er at deltakaren skal kunne lese og forstå ord, setningar og korte, svært enkle tekstar om kjende daglegdagse emne.

source: • give a prepared presentation on a familiar topic, both with and without the
nn: • halde ein førebudd presentasjon om eit kjent emne, både med og utan bruk

source: messages and instructions;
nn: beskjedar og instruksjonar

source: they understand or need clarification, and asking if others understand.
nn: ein forstår eller treng oppklaring, og spørje om andre forstår

source: • employ different interaction strategies, such as interjecting in a discussion
nn: • bruke ulike samhandlingsstrategiar, for eksempel å gripe inn i ein diskusjon

source: Later the person develops a good, adapted (necessary) vocabulary and more complex structures.
nn: Seinare byggjer ein ut eit godt og tilpassa (nødvendig) vokabular og meir komplekse strukturar.

source: Do you want to appeal the result?
nn: Ønsker du å klage på resultatet?

source: In social studies, oral communication skills involve being able to listen to, interpret, formulate, present and explain opinions, respond and discuss with others.
nn: Munnlege ferdigheiter i samfunnskunnskap inneber å kunne lytte til, tolke, formulere, fremme og grunngi meiningar, gi respons og diskutere med andre.

source: – payment from the employer instead of salary in connection with
nn: – utbetaling frå arbeidsgjevaren i staden for løn i samband med

source: • write detailed descriptions of people, places, events and experiences;
nn: • beskrive personar, stader, hendingar og opplevingar på ein detaljert måte

source: The goal is to be able to express one’s opinion, and to understand what others say.
nn: Målet er å kunna uttrykkja kva ein meiner, og å forstå det andre seier.

source: Each core element shows how to combine different language skills and strategies in order to develop and use the language in familiar and unfamiliar communicative situations.
nn: Kjerneelementa viser på kvar sin måte korleis ein må kombinere ulike språkferdigheiter og strategiar for å utvikle og bruke språket i kjende og ukjende kommunikasjonssituasjonar.

source: C1 users will have greater linguistic success within their occupation and area of interest than in disciplines and areas of interest that are unfamiliar or new to them.
nn: Ein C1-brukar vil klare seg betre språkleg innanfor sitt eige fagområde og interessefelt enn innanfor fagområde og interessefelt som er ukjende eller nye.

source: • describe and provide information about people, objects, places, events and
nn: • beskrive og fortelje om personar, gjenstandar, stader, hendingar og

source: • write down the main points from a meeting or a professional presentation on
nn: • notere hovudpunkt frå eit møte eller ein fagleg presentasjon om eit kjent

source: This means being able to find mathematical information in Norwegian, being able to communicate and argue in favour of decisions that require arithmetic, and recognising and describing mathematical information in Norwegian.
nn: Det inneber å kunne innhente matematisk informasjon på norsk, kunne kommunisere og argumentere for val som inneber rekning, og kjenne att og beskrive matematisk informasjon på norsk.

source: • start or initiate, without preparation, simple conversations and discussions
nn: • starte eller gå uførebudd inn i, oppretthalde og avslutte enkle samtalar og

source: • Taking children/young people or others out of Norway to marry
nn: • Det er forbode å ta barn/ungdom eller andre ut av Noreg for å

source: Using computer programs other than the test application (e.g. Word, Notepad)
nn: bruk av andre dataprogram enn prøvesystemet (til dømes Word, Notisblokk)

source: This means that when you register for the test, you have to pay for it even if you are unable to take it.
nn: Det betyr at når du melder deg på prøven, må du betale for han sjølv om du ikkje kan ta han.

source: • read and understand the main points in short, simple news reports and
nn: • lese og forstå hovudpunkt i korte, enkle nyheitsmeldingar og enkle,

source: – The parties must be aged over 18.
nn: – dei som giftar seg, er over 18 år

source: Selling drugs is punishable by imprisonment for up to 10 years.
nn: Sal av narkotika kan straffast med fengsel i inntil 10 år.

source: Selling large quantities of drugs is punishable by imprisonment for up to 21 years.
nn: Sal av store mengder narkotika kan straffast med fengsel i inntil 21 år.

source: Their vocabulary has the breadth and depth necessary for them to understand and actively engage with a wide range of general topics, situations and oral and written texts.
nn: Ordforrådet er breitt og djupt nok til at innlæraren forstår og aktivt taklar eit breitt spekter av allmenne emne, situasjonar og munnlege og skriftlege tekstar.

source: One of the main principles of language training is use of language together with others (Swain 1995 and Painter GUIDE TO METHODS – THE ORAL APPROACH TO LANGUAGE LEARNING
nn: Eit av dei viktigaste prinsippa i språkinnlæring er å bruka språket i lag med andre (Swain 1995 METODISK RETTLEIING – MUNNLEG OPPLÆRING

source: important to her parents that Memona should get married?
nn: det er viktig for foreldra at Memona giftar seg?

source: • employ different linguistic tools to express attitudes, emotions and moods.
nn: • kan bruke ulike språklege verkemiddel for å uttrykke haldningar, kjensler og

source: • correctly convey most nuances and details in oral and written texts, but may
nn: • kan formidle vidare dei fleste nyansar og detaljar i munnlege og skriftlege

source: Participants can take part in very simple, familiar interactions if their conversation partners adapt their language and are supportive.
nn: Deltakaren kan delta i svært enkle, kjende samhandlingssituasjonar dersom samhandlingspartnarane tilpassar språket og er støttande.

source: • collaborate on simple tasks by making suggestions, asking what others
nn: • samarbeide om enkle oppgåver ved å komme med forslag, spørje kva andre

source: The teacher must have clear but realistic expectations of each participant.
nn: Læraren må ha tydelege, men realistiske forventningar til den enkelte deltakaren.

source: The objective of the training is for participants to be able to read independently for the most part and to understand complex texts from different genres within a wide range of general topics and topics within their occupation and areas of interest.
nn: Mål for opplæringa er at deltakaren skal kunne lese med stor grad av sjølvstende og forstå komplekse tekstar i ulike sjangrar innanfor eit vidt spekter av allmenne emne og emne knytte til eige fag- og interessefelt.

source: • A «party rape» is a rape that takes
nn: • Ei «festvaldtekt» er ei valdtekt som

source: Mediation takes place in the same language or across languages, and includes facilitating understanding and successful communication between people from different backgrounds.
nn: Mediering skjer innanfor same språk eller på tvers av språk, og inkluderer det å legge til rette for forståing og vellykka kommunikasjon mellom menneske med ulik bakgrunn.

source: • give examples of how physical and mental health can be affected by lifestyle
nn: • gi eksempel på korleis fysisk og psykisk helse kan bli påverka av livsstil og

source: One evening Hans is especially eager.
nn: Ein kveld er Hans ekstra pågåande.

source: Both previous and current negative learning experiences can impact on the learning outcome.
nn: Både tidlegare og noverande negative læringserfaringar kan påverka læringseffekten.

source: • The victim and the perpetrator are
nn: • Offeret og gjerningspersonen er ofte

source: • write numbers when specifying, for example, dates, times, quantities and
nn: • bruke tal i for eksempel dato, klokkeslett, mengde og pris i skriftlege tekstar

source: INTERDISCIPLINARY TOPICS | 6 | KAP 4 Reception includes, for example, using strategies to understand oral instructions that contain unfamiliar words, searching for and understanding specific information in a text or reading information online and evaluating it critically.
nn: Resepsjon inkluderer for eksempel det å bruke strategiar for å forstå munnlege instruksjonar som inneheld ukjende ord, leite etter og forstå spesifikk informasjon i ein tekst eller lese informasjon på nettet og vurdere han kritisk. TVERRFAGLEGE TEMA | 6 | KAP 4

source: points of view and attitudes in a detailed and nuanced way;
nn: oppbygging og gi uttrykk for synspunkt og haldningar på ein utfyllande og nyansert måte

source: Ole replies that they had sex.
nn: Ole svarer at dei har hatt sex.

source: If you are registered with a Norwegian personal identification number (fødselsnummer), you can use ID-porten
nn: Er du registrert med fødselsnummer i Kompetanse Noreg sitt prøvesystem, kan du bruke ID-porten til

source: • write reports and accounts on complex topics related to their occupation or area
nn: • kan skrive rapportar og utgreiingar om komplekse tema innanfor sitt eige fag-

source: Reception may consist of listening or reading, or both in combination.
nn: Resepsjon kan vere å lytte eller lese, eller begge delar i kombinasjon.

source: The rape of a sleeping or unconscious person or a rape in a close relationship is punishable in the same way as other types of rape.
nn: Valdtekt av ein person som søv eller er bevisstlaus, og valdtekt i nære relasjonar blir straffa på same måte som anna valdtekt.

source: ceremonies of baptism, confirmation, marriage and funerals.
nn: som dåp, konfirmasjon, vigsel og gravferd.

source: underpinning their arguments with supporting points and relevant examples;
nn: utvikle og underbygge argumenta sine med underpunkt og relevante eksempel

source: You must register an email address to have access to Min side.
nn: Du kan ikkje bruke Min side for å dele resultata dine til for eksempel arbeidsgjevarar.

source: In tax class 2 you get higher deductions and lower tax.
nn: skatteklasse 2 får ein et høgre frådrag og lægre skatt.

source: • give clear and detailed descriptions and presentations of personal or
nn: Innlæraren • kan gi klare, detaljerte utgreiingar om og presentasjonar av personlege eller

source: imprisonment for up to 21 years.
nn: fengsel i inntil 21 år.

source: Formative assessment The formative assessment will promote learning and expand competence in the subject.
nn: Undervegsvurdering Undervegsvurderinga skal bidra til å fremme læring og til å utvikle kompetanse i faget.

source: • discuss negative social control, violence in close relationships, forced
nn: • samtale om kva negativ sosial kontroll, vald i nære relasjonar,

source: • discuss the importance of critical thinking and ethical awareness, including
nn: • samtale om betydninga av kritisk tenking og etisk bevisstheit, mellom anna

source: Lisa and her girlfriends had been out to a bar.
nn: Lisa og venninnene hennar har vore ute på bar.

source: • employ simple strategies to compensate for vocabulary deficits, for example
nn: • bruke enkle strategiar for å kompensere for manglar i ordforrådet, for

source: • understand the main content and some details in short, simple notifications,
nn: • forstå hovudinnhaldet og enkelte detaljar i korte, enkle meldingar,

source: • Can this advice help Niwar’s parents?
nn: • Kan desse råda hjelpe foreldra til Niwar?

source: Lisa wakes Ole and asks him what happened.
nn: Lisa vekker Ole og spør kva som har skjedd.

source: everyday words from a very simple context or based on similarities with other languages they speak.
nn: daglegdagse ord ut frå ein svært enkel kontekst eller med bakgrunn i likskapar med andre språk deltakaren kjenner

source: conversations, discussions and debates;
nn: samtalar, diskusjonar og debattar

source: • give examples of a person's rights and obligations as an employee in terms
nn: • gi eksempel på rettar og plikter ein har som arbeidstakar, i samband med

source: • describe a problem, ask for advice and understand a clearly formulated
nn: • beskrive eit problem, be om råd og forstå eit klart formulert svar

source: • understand the main points and some specific details in conversations and
nn: • forstå hovudpoeng og enkelte spesifikke detaljar i samtalar og diskusjonar

source: • use individual words and a few short phrases to write about something they
nn: • bruke enkeltord og nokre korte frasar til å skrive om noko ein ser, for

source: Learners understand a complex oral presentation, also when the speech is not clearly structured and matters are not mentioned directly, but are implicit.
nn: Innlæraren kan forstå ei kompleks munnleg framstilling, også når talen ikkje er tydeleg strukturert og forhold ikkje er omtalte direkte, men underforstått.

source: • apply knowledge about key rights, obligations and opportunities as a
nn: • bruke kunnskap om sentrale rettar, plikter og moglegheiter som nykommen

source: • read and understand everyday texts such as letters, emails and posts on
nn: • lese og forstå kvardagslege tekstar som brev, e-postar og innlegg på sosiale

source: • use numbers and expressions for time, quantities and prices in everyday
nn: • bruke tal og uttrykk for tid, mengder og prisar i daglegdagse

source: – Family planning and access to contraception
nn: – familieplanlegging og tilgang til prevensjon

source: Participants should be able to take part in simple, familiar spoken situations in everyday life when their conversation partner speaks slowly and clearly and is willing to be supportive.
nn: Deltakaren skal kunne delta i enkle, kjende munnlege samhandlingssituasjonar i dagleglivet når samtalepartnaren snakkar langsamt og tydeleg og er innstilt på å hjelpe.

source: • give a short, simple, prepared presentation on a familiar topic, both with and
nn: • gi ein kort, enkel, førebudd presentasjon om eit kjent emne, både med og

source: • use context to support reading comprehension;
nn: • bruke konteksten som støtte for leseforståing

source: A good verbal foundation is not only a prerequisite for learning to read and write a new language, but also for participation at every level of society.
nn: Eit godt munnleg grunnlag er ikkje berre ein føresetnad for å læra å lesa og skriva eit nytt språk, men òg for å kunna delta på alle nivå i samfunnet.

source: When you have taken the test, you can print, save or send the result.
nn: Når du har teke testen, kan du skrive ut, lagre eller sende resultatet.

source: • All expectant mothers are entitled to ultrasound examinations in weeks 17 to 19
nn: • Alle gravide får tilbod om ultralydundersøking i 17.–19.

source: If you have any questions about the date of your test, contact the test centre.
nn: Har du spørsmål om dato for prøven din, må du kontakte prøvestaden din.

source: • discuss different traditions and views of religion in Norwegian society and
nn: • samtale om ulike tradisjonar og syn på religion i det norske samfunnet og

source: Forging your test certificate
nn: Forfalsking av prøvebevis

source: • provide complex information and clear, detailed instructions and messages;
nn: • gi kompleks informasjon og klare, detaljerte instruksjonar og beskjedar

source: • The legal age of consent in Norway is 16 years of age.
nn: • Den seksuelle lågalderen i Noreg er 16 år.

source: This often entails combining reception and production, and can take place both orally and in writing.
nn: Det inneber ofte at ein må kombinere resepsjon og produksjon, og kan skje både munnleg og skriftleg.

source: In order to succeed at this, participants must be able to use their Norwegian language skills together with their other knowledge and skills, and in an interplay with situational resources and other people.
nn: For å lykkast med dette må deltakarane kunne bruke norskferdigheitene saman med andre kunnskapar og ferdigheiter dei har, og i samspel med ressursar i omgivnadene og med andre menneske.

source: • use very simple phrases to give information about themselves and their
nn: • bruke svært enkle frasar for å fortelje om seg sjølv og sin eigen bakgrunn

source: • Female genital mutilation is a general term for female circumcision.
nn: • Kjønnslemlesting er ei felles nemning for kvinneleg omskjering.

source: • understand a varied range of fiction texts in modern language.
nn: • kan forstå eit variert utval av skjønnlitterære tekstar i moderne språkdrakt

source: • read and understand complex instructions and user manuals relating to their
nn: • lese og forstå komplekse instruksjonar og bruksrettleiingar knytte til eige

source: • employ appropriate search techniques and reading methods to find relevant
nn: • bruke formålstenlege søketeknikkar og lesemåtar for å finne relevant

source: • help others understand words from a text by translating it into a common
nn: • hjelpe andre med å forstå ord frå ein tekst ved å omsette til eit felles språk,
